system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

xmin -0.15;
xmax 0.15;

ymin -0.15;
ymax 0.15;

zmin 0.0;
zmax 2.2;

vertices
(
    ( $xmin  $ymin  $zmin )
    ( $xmax  $ymin  $zmin )
    ( $xmax  $ymax  $zmin )
    ( $xmin  $ymax  $zmin )
    ( $xmin  $ymin  $zmax )
    ( $xmax  $ymin  $zmax )
    ( $xmax  $ymax  $zmax )
    ( $xmin  $ymax  $zmax )
);

blocks
(
//    hex (0 1 2 3 4 5 6 7) (50 50 350) simpleGrading (1 1 1)
    hex (0 1 2 3 4 5 6 7) (10 10 70) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    maxY
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    minX
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    maxX
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }

    minY
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }

    minZ
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    maxZ
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
